<template>
	<div class="about-box">
		<scoreheader :title="title"></scoreheader>
		<div class="about-tip">
			<div class="title" style="margin-top: 0;">CGC平台注册协议</div>
			<p class="le2">
				欢迎您阅读《CGC平台注册协议》（下称 “本协议”）并使用CGC平台服务。您在申请注册流程中点击同意前，应当认真阅读以下协议。
			</p>
			<p class="le2">
				请您务必审慎阅读、充分理解协议中相关条款内容，如您对协议有任何疑问，可向平台客服咨询。当您按照注册页面提示填写信息、阅读并同意协议且完成全部注册程序后，即表示您已充分阅读、理解并接受协议的全部内容。如您因平台服务而发生争议的，适用《CGC平台注册协议》处理。阅读协议的过程中，如果您不同意以下协议或其中任何条款约定，您应立即停止注册程序。
			</p>
			<div class="twoTitle">一、定义</div>
			<p class="le2">CGC平台（以下简称“平台”）规则：包括平台已经发布及后续发布的规则、解读、 公告等内容以及平台在帮助中心内发布的各类规则、说明、公告等。 积分：指与用户所存储金额等值、可用于消费的健康属性量值。</p>
			<div class="twoTitle">二、 协议范围本协议甶您与平台共同缔结，本协议对您与平台均具有法律效力。</div>
			<div class="twoTitle">三、 账户注册与使用</div>
			<div>
				<P class="le2">3.1 用户资格</p>
				<p class="le2">
					在注册程序使用平台服务前，您应当具备完全民事行为能力。若您不具备，则您及您的监护人应依照法律规定承担因此而导致的一切后果。
				</p>
				<P class="le2">3.2 账户说明</p>
				<p class="le2">
					当您阅读并同意本协议且完成全部注册程序后，您可获得您的平台账户并成为平台储值消费会员。您有权使用您用于注册的手机号登陆平台。甶于您的平台账户关联您的个人信息及平台商业信息，您的平台账户仅限您本人使用。未经平台同意，您直接或间接授权或转让第三方使用您平台账户或获取您账户项下信息的行为无效。仅当有法律明文规定、司法裁定或经平台同意，并符合平台规则规定的平台账户授权或转让流程的情况下，您可进行平台账户授权或转让。由于平台账户关联用户信用信息，您的平台账户一经转让，您的平台账户各项权利义务一并转移。 除此外， 您的平台账户不得以任何方式转让，否则平台有权追究您的违约责任，且由此产生的一切责任均由您承担。
				</p>
				<P class="le2">3.3 账户安全规范</p>
				<p class="le2">
					除平台存在过错外，您应对您账户项下的所有行为结果（包括但不限于在线签署各 类协议、购买商品、购买积分等）负责。如发现任何未经授权使用您账户登陆平台或其他可能导致您账户遭窃、遗失的情况建议您立即通知平台。您理解平台对您的任何请求采取行动均需要合理时间，且平台应您请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大，除平台存在法定过错外，平台不承担责任。
				</p>
				<P class="le2">3.4 实名注册会员</p>
				<p class="le2">
					在您按照注册页面提示填写信息、阅读并同意本协议并完成全部注册程序后或以其他本公司允许的方式实际使用“平台”服务 时，您即成为“平台”会员（亦称会员）。 在注册时，您应当按照法律法规要求，或按注册页面的提示准确提供，并及时更新您的资料，以使之真实、及时，完整和准确。如平台在审核您的相关资料时，发现您提供的资料错误、不实、过时或不完整的，平台有权向您发出询问及/或要求改正的通知，并有权直接做出删除相应资料的处理，直至终止对您提供部分或全部“平台”服 务。平台对此不承担任何责任，您将承担因此产生的任何直接或间接支出。 您应当准确填写并及时更新您提供的电子邮件 地址、联系电话、联系地址、邮政编码等联系方式，以便平台及您需要的商家与您进行有效联系，因通过这些联系方式无法与您取得联系，导致您在使用“平台”服务过 程中产生任何损失或增加费用的，应甶您自行承担承担。您在使用“平台”服务过程 中，所产生的应交税赋，以及一切硬件软件、报名及其他方面的费用，均由您独自承担。
				</p>
				<div class="twoTitle">四、平台服务及规则</div>
				<p class="le2">1. 平台注册会员可按照平台指引，正确使用平台分享码，并在法律、 法规允许的范围内进行推广。如若因个人不当推广行为及非法操作所产生的一切不利后果均甶您自行承担。给平台造成损失的，平台有权向您索赔。</p>
				<p class="le2">2. 您在“平台”上与其他会员发生纠纷时， 一旦您或其它会员任一方或双方共同提交平台要求调处，则平台有权根据相关条款判断做出调处决定，您了解并同意接受平台的判断和调处决定。该决定将对您具有法律约束力。</p>
				<p class="le2">3. 您了解并同意，平台有权应政府部门 (包括司法及行政部门）的要求，向其提供您在“平台”填写的注册信息和相关纪录等必要信息。如您涉嫌侵犯他人权益，则平台亦有权在初步判断涉嫌侵权行为存在的情况下，向权利人提供您必要的身份信息。</p>
				<p class="le2">4. 您有权在平台进行储值、消费和结算。 请您务必仔细确认您所执行的各类操作的 重要内容，并核实您的联系地址、电话、 姓名等信息。</p>
				<p class="le2">5. 您的行为应当基于真实的消费需求，不得存在对商品及/或服务实施恶意购买、 恶意维权等扰乱平台正常交易秩序的行为。基于维护平台交易秩序及交易安全的需要 发现上述情形时平台有权主动执行关闭相关交易订单程序等操作。</p>
				<div class="twoTitle">五、隐私保护</div>
				<p>平台不对外公开或向第三方提供您的注册账号信息及您在使用网络服务时存储在平台的非公开内容，下列情况除外：</p>
				<p class="le2">根据有关的法律法规要求;</p>
				<p class="le2">按照相关政府主管部门要求;</p>
				<p class="le2">为维护社会公众的利益;</p>
				<p class="le2">在不透露您的隐私的前提下，平台有权对整个用户数据库的进行分析并进行商业上的利用;</p>
				<div class="twoTitle">六、 版权声明</div>
				<p class="le2">平台的商标、版面设计等版权均为平台所有，平台同意您免费使用，但不得任意改变平台所有的注册商标文字、图形或者其 他内容或事物。</p>
				<div class="twoTitle">七、 附则</div>
				<p class="le2">7.1 本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议 的其余条款仍应有效并且有约束力。</p>
				<p class="le2">7.2 本协议解释权及修订权归平台所有。</p>
			</div>
		</div>
	</div>
</template>

<script>
	import scoreheader from '../../../components/setting_header'
	export default {
		components: {
			scoreheader
		},
		data() {
			return {
				title: 'CGC平台注册协议',
			}
		},
		beforeRouteLeave(to, from, next) {
			if(to.path == '/user/reg') {
				to.meta.keepAlive = true
			} else {
				to.meta.keepAlive = false
			}
			next()
		},
		methods: {

		}
	}
</script>

<style lang="less" scoped>
	.about-box {
		height: 100%;
		background: white;
		.about-tip {
			.le2 {
				text-indent: 0.4rem;
				margin: 0.2rem 0;
			}
			padding: 0.27rem;
			font-family: PingFangSC-Medium;
			position: relative;
			.title {
				font-size: 0.32rem;
				margin: 0.27rem 0;
				color: rgba(26, 38, 66, 1);
				text-align: center;
			}
			p {
				font-size: 0.28rem;
				color: rgba(26, 38, 66, 1);
			}
			.twoTitle {
				font-size: 0.28rem;
				color: rgba(51, 111, 255, 1);
				margin: 0.15rem 0;
			}
		}
		.about-tip:before {
			content: " ";
			position: absolute;
			left: 0;
			top: 0;
			right: 0;
			height: 1px;
			border-top: 1px solid #D9D9D9;
			color: #D9D9D9;
			-webkit-transform-origin: 0 0;
			transform-origin: 0 0;
			-webkit-transform: scaleY(0.5);
			transform: scaleY(0.5);
			left: 0px;
		}
	}
</style>